---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.AnalysisResultSchema
source: html/94d5a0b6-9578-aeac-9c93-4975cfce95b8.htm
---
# AnalysisResultSchema Properties

ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden